chrishamm/ArduinoDuet/boards.txt
duet.name=RepRap Duet Platform
duet.vid=0x2341
duet.pid=0x003e
duet.upload.tool=bossac
duet.upload.protocol=sam-ba
duet.upload.maximum_size=524288
duet.upload.use_1200bps_touch=true
duet.upload.wait_for_upload_port=true
duet.upload.native_usb=true
duet.build.board=SAM_DUE
duet.build.mcu=cortex-m3
duet.build.chip=sam3x
duet.build.f_cpu=84000000L
duet.build.usb_product="Duet"
duet.build.core=arduino
duet.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
duet.build.ldscript=linker_scripts/gcc/flash.ld
duet.build.variant=duet
duet.build.variant_system_lib=libDuet.a
duet.build.vid=0x2341
duet.build.pid=0x003e

duetNG.name=RepRap DuetNG Platform
duetNG.vid=0x03eb
duetNG.pid=0x2404
duetNG.upload.tool=bossac
duetNG.upload.protocol=sam-ba
duetNG.upload.maximum_size=1048576
duetNG.upload.use_1200bps_touch=true
duetNG.upload.wait_for_upload_port=true
duetNG.upload.native_usb=true
duetNG.build.board=SAM_DUE
duetNG.build.mcu=cortex-m4
duetNG.build.chip=sam4e
duetNG.build.f_cpu=120000000UL
duetNG.build.usb_product="Duet WiFi"
duetNG.build.core=arduino
duetNG.build.extra_flags=-D__SAM4E8E__ -mthumb {build.usb_flags}
duetNG.build.ldscript=linker_scripts/gcc/flash.ld
duetNG.build.variant=duetNG
duetNG.build.variant_system_lib=libDuetNG.a
duetNG.build.vid=0x03eb
duetNG.build.pid=0x2404
